tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18344_tdd.h
#define ODCC5                         522
#define ODCC6                         523
#define ODCC7                         524
#define CCPR1L                        525
#define CCPR1H                        526
#define CCP1CON                       527
#define CCP1MODE                      528
#define CCP1MODE0                     529
#define CCP1MODE1                     530
#define CCP1MODE2                     531
#define CCP1MODE3                     532
#define CCP1FMT                       533
#define CCP1OUT                       534
#define CCP1EN                        535
#define CCP1CAP                       536
#define CCP1CTS                       537
#define CCP1CTS0                      538
#define CCP1CTS1                      539
#define CCP1CTS2                      540
#define CCP1CTS3                      541
#define CCPR2L                        542
#define CCPR2H                        543
#define CCP2CON                       544
#define CCP2MODE                      545
#define CCP2MODE0                     546
#define CCP2MODE1                     547
#define CCP2MODE2                     548
#define CCP2MODE3                     549
#define CCP2FMT                       550
#define CCP2OUT                       551
#define CCP2EN                        552
#define CCP2CAP                       553
#define CCP2CTS                       554
#define CCP2CTS0                      555
#define CCP2CTS1                      556
#define CCP2CTS2                      557
#define CCP2CTS3                      558
#define CCPTMRS                       559
#define C1TSEL0                       560
#define C1TSEL                        561
#define C1TSEL1                       562
#define C2TSEL0                       563
#define C2TSEL                        564
#define C2TSEL1                       565
#define C3TSEL0                       566
#define C3TSEL                        567
#define C3TSEL1                       568
#define C4TSEL                        569
#define C4TSEL0                       570
#define C4TSEL1                       571
#define SLRCONA                       572
#define SLRA0                         573
#define SLRA1                         574
#define SLRA2                         575
#define SLRA4                         576
#define SLRA5                         577
#define SLRCONB                       578
#define SLRB4                         579
#define SLRB5                         580
#define SLRB6                         581
#define SLRB7                         582
#define SLRCONC                       583
#define SLRC0                         584
#define SLRC1                         585
#define SLRC2                         586
#define SLRC3                         587
#define SLRC4                         588
#define SLRC5                         589
#define SLRC6                         590
#define SLRC7                         591
#define CCPR3L                        592
#define CCPR3H                        593
#define CCP3CON                       594
#define CCP3MODE0                     595
#define CCP3MODE                      596
#define CCP3MODE1                     597
#define CCP3MODE2                     598
#define CCP3MODE3                     599
#define CCP3FMT                       600
#define CCP3OUT                       601
#define CCP3EN                        602
#define CCP3CAP                       603
#define CCP3CTS                       604
#define CCP3CTS0                      605
#define CCP3CTS1                      606
#define CCP3CTS2                      607
#define CCP3CTS3                      608
#define CCPR4L                        609
#define CCPR4H                        610
#define CCP4CON                       611
#define CCP4MODE                      612
#define CCP4MODE0                     613
#define CCP4MODE1                     614
#define CCP4MODE2                     615
#define CCP4MODE3                     616
#define CCP4FMT                       617
#define CCP4OUT                       618
#define CCP4EN                        619
#define CCP4CAP                       620
#define CCP4CTS                       621
#define CCP4CTS0                      622
#define CCP4CTS1                      623
#define CCP4CTS2                      624
#define CCP4CTS3                      625
#define INLVLA                        626
#define INLVLA0                       627
#define INLVLA1                       628
#define INLVLA2                       629
#define INLVLA3                       630
#define INLVLA4                       631
#define INLVLA5                       632
#define INLVLB                        633
#define INLVLB4                       634
#define INLVLB5                       635
#define INLVLB6                       636
#define INLVLB7                       637
#define INLVLC                        638
#define INLVLC0                       639
#define INLVLC1                       640
#define INLVLC2                       641
#define INLVLC3                       642
#define INLVLC4                       643
#define INLVLC5                       644
#define INLVLC6                       645
#define INLVLC7                       646
#define IOCAP                         647
#define IOCAP0                        648
#define IOCAP1                        649
#define IOCAP2                        650
#define IOCAP3                        651
#define IOCAP4                        652
#define IOCAP5                        653
#define IOCAN                         654
#define IOCAN0                        655
#define IOCAN1                        656
#define IOCAN2                        657
#define IOCAN3                        658
#define IOCAN4                        659
#define IOCAN5                        660
#define IOCAF                         661
#define IOCAF0                        662
#define IOCAF1                        663
#define IOCAF2                        664
#define IOCAF3                        665
#define IOCAF4                        666
#define IOCAF5                        667
#define IOCBP                         668
#define IOCBP4                        669
#define IOCBP5                        670
#define IOCBP6                        671
#define IOCBP7                        672
#define IOCBN                         673
#define IOCBN4                        674
#define IOCBN5                        675
#define IOCBN6                        676
#define IOCBN7                        677
#define IOCBF                         678
#define IOCBF4                        679
#define IOCBF5                        680
#define IOCBF6                        681
#define IOCBF7                        682
#define IOCCP                         683
#define IOCCP0                        684
#define IOCCP1                        685
#define IOCCP2                        686
#define IOCCP3                        687
#define IOCCP4                        688
#define IOCCP5                        689
#define IOCCP6                        690
#define IOCCP7                        691
#define IOCCN                         692
#define IOCCN0                        693
#define IOCCN1                        694
#define IOCCN2                        695
#define IOCCN3                        696
#define IOCCN4                        697
#define IOCCN5                        698
#define IOCCN6                        699
#define IOCCN7                        700
#define IOCCF                         701
#define IOCCF0                        702
#define IOCCF1                        703
#define IOCCF2                        704
#define IOCCF3                        705
#define IOCCF4                        706
#define IOCCF5                        707
#define IOCCF6                        708
#define IOCCF7                        709
#define CLKRCON                       710
#define CLKRDIV                       711
#define CLKRDIV0                      712
#define CLKRDIV1                      713
#define CLKRDIV2                      714
#define CLKRDC                        715
#define CLKRDC0                       716
#define CLKRDC1                       717
#define CLKREN                        718
#define MDCON                         719
#define MDBIT                         720
#define MDOUT                         721
#define MDOPOL                        722
#define MDEN                          723
#define MDSRC                         724
#define MDMS0                         725
#define MDMS                          726
#define MDMS1                         727
#define MDMS2                         728
#define MDMS3                         729
#define MDCARH                        730
#define MDCH                          731
#define MDCH0                         732
#define MDCH1                         733
#define MDCH2                         734
#define MDCH3                         735
#define MDCHSYNC                      736
#define MDCHPOL                       737
#define MDCARL                        738
#define MDCL0                         739
#define MDCL                          740
#define MDCL1                         741
#define MDCL2                         742
#define MDCL3                         743
#define MDCLSYNC                      744
#define MDCLPOL                       745
#define CCDNA                         746
#define CCDNA0                        747
#define CCDNA1                        748
#define CCDNA2                        749
#define CCDNA4                        750
#define CCDNA5                        751
#define CCDNB                         752
#define CCDNB4                        753
#define CCDNB5                        754
#define CCDNB6                        755
#define CCDNB7                        756
#define CCDNC                         757
#define CCDNC0                        758
#define CCDNC1                        759
#define CCDNC2                        760
#define CCDNC3                        761
#define CCDNC4                        762
#define CCDNC5                        763
#define CCDNC6                        764
#define CCDNC7                        765
#define TMR3L                         766
#define TMR3H                         767
#define T3CON                         768
#define TMR3ON                        769
#define T3SYNC                        770
#define T3SOSC                        771
#define T3CKPS                        772
#define T3CKPS0                       773
#define T3CKPS1                       774
#define TMR3CS0                       775
#define TMR3CS                        776
#define TMR3CS1                       777
#define T3GCON                        778
#define T3GSS0                        779
#define T3GSS                         780
#define T3GSS1                        781
#define T3GVAL                        782
#define T3GGO_nDONE                   783
#define T3GSPM                        784
#define T3GTM                         785
#define T3GPOL                        786
#define TMR3GE                        787
#define TMR4                          788
#define PR4                           789
#define T4CON                         790
#define T4CKPS0                       791
#define T4CKPS                        792
#define T4CKPS1                       793
#define TMR4ON                        794
#define T4OUTPS                       795
#define T4OUTPS0                      796
#define T4OUTPS1                      797
#define T4OUTPS2                      798
#define T4OUTPS3                      799
#define TMR5L                         800
#define TMR5H                         801
#define T5CON                         802
#define TMR5ON                        803
#define T5SYNC                        804
#define T5SOSC                        805
#define T5CKPS                        806
#define T5CKPS0                       807
#define T5CKPS1                       808
#define TMR5CS0                       809
#define TMR5CS                        810
#define TMR5CS1                       811
#define T5GCON                        812
#define T5GSS                         813
#define T5GSS0                        814
#define T5GSS1                        815
#define T5GVAL                        816
#define T5GGO_nDONE                   817
#define T5GSPM                        818
#define T5GTM                         819
#define T5GPOL                        820
#define TMR5GE                        821
#define TMR6                          822
#define PR6                           823
#define T6CON                         824
#define T6CKPS0                       825
#define T6CKPS                        826
#define T6CKPS1                       827
#define TMR6ON                        828
#define T6OUTPS0                      829
#define T6OUTPS                       830
#define T6OUTPS1                      831
#define T6OUTPS2                      832
#define T6OUTPS3                      833
#define CCDCON                        834
#define CCDS                          835
#define CCDS0                         836
#define CCDS1                         837
#define CCDEN                         838
#define CCDPA                         839
#define CCDPA0                        840
#define CCDPA1                        841
#define CCDPA2                        842
#define CCDPA4                        843
#define CCDPA5                        844
#define CCDPB                         845
#define CCDPB4                        846
#define CCDPB5                        847
#define CCDPB6                        848
#define CCDPB7                        849
#define CCDPC                         850
#define CCDPC0                        851
#define CCDPC1                        852
#define CCDPC2                        853
#define CCDPC3                        854
#define CCDPC4                        855
#define CCDPC5                        856
#define CCDPC6                        857
#define CCDPC7                        858
#define NCO1ACCL                      859
#define NCO1ACCL_NCO1ACC              860
#define NCO1ACCH                      861
#define NCO1ACCH_NCO1ACC              862
#define NCO1ACCU                      863
#define NCO1ACCU_NCO1ACC              864
#define NCO1INCL                      865
#define NCO1INCL_NCO1INC              866
#define NCO1INCH                      867
#define NCO1INCH_NCO1INC              868
#define NCO1INCU                      869
#define NCO1INCU_NCO1INC              870
#define NCO1CON                       871
#define N1PFM                         872
#define N1POL                         873
#define N1OUT                         874
#define N1EN                          875
#define NCO1CLK                       876
#define N1CKS                         877
#define N1PWS                         878
#define PWM5DCL                       879
#define PWM5DCL0                      880
#define PWM5DCL1                      881
#define PWM5DCH                       882
#define PWM5DCH0                      883
#define PWM5DCH1                      884
#define PWM5DCH2                      885
#define PWM5DCH3                      886
#define PWM5DCH4                      887
#define PWM5DCH5                      888
#define PWM5DCH6                      889
#define PWM5DCH7                      890
#define PWM5CON                       891
#define PWM5POL                       892
#define PWM5OUT                       893
#define PWM5EN                        894
#define PWM6DCL                       895
#define PWM6DCL0                      896
#define PWM6DCL1                      897
#define PWM6DCH                       898
#define PWM6DCH0                      899
#define PWM6DCH1                      900
#define PWM6DCH2                      901
#define PWM6DCH3                      902
#define PWM6DCH4                      903
#define PWM6DCH5                      904
#define PWM6DCH6                      905
#define PWM6DCH7                      906
#define PWM6CON                       907
#define PWM6POL                       908
#define PWM6OUT                       909
#define PWM6EN                        910
#define PWMTMRS                       911
#define P5TSEL                        912
#define P5TSEL0                       913
#define P5TSEL1                       914
#define P6TSEL0                       915
#define P6TSEL                        916
#define P6TSEL1                       917
#define CWG1CLKCON                    918
#define CWG1CLKCON_CS                 919
#define CWG1CS                        920
#define CWG1DAT                       921
#define CWG1DAT_DAT                   922
#define CWG1DAT0                      923
#define CWG1DAT1                      924
#define CWG1DAT2                      925
#define CWG1DAT3                      926
#define CWG1DBR_DBR                   927
#define CWG1DBR0                      928
#define CWG1DBR_DBR0                  929
#define CWG1DBR                       930
#define CWG1DBR1                      931
#define CWG1DBR_DBR1                  932
#define CWG1DBR2                      933
#define CWG1DBR_DBR2                  934
#define CWG1DBR3                      935
#define CWG1DBR_DBR3                  936
#define CWG1DBR_DBR4                  937
#define CWG1DBR4                      938
#define CWG1DBR5                      939
#define CWG1DBR_DBR5                  940
#define CWG1DBF                       941
#define CWG1DBF0                      942
#define CWG1DBF_DBF                   943
#define CWG1DBF_DBF0                  944
#define CWG1DBF1                      945
#define CWG1DBF_DBF1                  946
#define CWG1DBF_DBF2                  947
#define CWG1DBF2                      948
#define CWG1DBF3                      949
#define CWG1DBF_DBF3                  950
#define CWG1DBF_DBF4                  951
#define CWG1DBF4                      952
#define CWG1DBF_DBF5                  953
#define CWG1DBF5                      954
#define CWG1CON0                      955
#define CWG1MODE0                     956
#define CWG1CON0_MODE                 957
#define CWG1CON0_MODE0                958
#define CWG1MODE                      959
#define CWG1MODE1                     960
#define CWG1CON0_MODE1                961
#define CWG1MODE2                     962
#define CWG1CON0_MODE2                963
#define CWG1CON0_LD                   964
#define CWG1LD                        965
#define CWG1EN                        966
#define G1EN                          967
#define CWG1CON0_EN                   968
#define CWG1CON1                      969
#define CWG1POLA                      970
#define CWG1CON1_POLA                 971
#define CWG1CON1_POLB                 972
#define CWG1POLB                      973
#define CWG1POLC                      974
#define CWG1CON1_POLC                 975
#define CWG1CON1_POLD                 976
#define CWG1POLD                      977
#define CWG1CON1_IN                   978
#define CWG1IN                        979
#define CWG1AS0                       980
#define CWG1LSAC                      981
#define CWG1AS0_LSAC0                 982
#define CWG1AS0_LSAC                  983
#define CWG1LSAC0                     984
#define CWG1AS0_LSAC1                 985
#define CWG1LSAC1                     986
#define CWG1AS0_LSBD0                 987
#define CWG1LSBD0                     988
#define CWG1LSBD                      989
#define CWG1AS0_LSBD                  990
#define CWG1LSBD1                     991
#define CWG1AS0_LSBD1                 992
#define CWG1AS0_REN                   993
#define CWG1REN                       994
#define CWG1AS0_SHUTDOWN              995
#define CWG1SHUTDOWN                  996
#define CWG1AS1                       997
#define CWG1AS1_AS0E                  998
#define CWG1AS1_AS1E                  999
#define CWG1AS1_AS2E                  1000
#define CWG1AS1_AS3E                  1001
#define CWG1AS1_AS4E                  1002
#define CWG1STR                       1003
#define CWG1STRA                      1004
#define CWG1STR_STRA                  1005
#define CWG1STRB                      1006
#define CWG1STR_STRB                  1007
#define CWG1STRC                      1008
#define CWG1STR_STRC                  1009
#define CWG1STR_STRD                  1010
#define CWG1STRD                      1011
#define CWG1OVRA                      1012
#define CWG1STR_OVRA                  1013
#define CWG1OVRB                      1014
#define CWG1STR_OVRB                  1015
#define CWG1OVRC                      1016
#define CWG1STR_OVRC                  1017
#define CWG1OVRD                      1018
#define CWG1STR_OVRD                  1019
#define CWG2CLKCON                    1020
#define CWG2CS                        1021
#define CWG2CLKCON_CS                 1022
#define CWG2DAT                       1023
#define CWG2DAT0                      1024
#define CWG2DAT_DAT                   1025
#define CWG2DAT1                      1026
#define CWG2DAT2                      1027
#define CWG2DAT3                      1028
#define CWG2DBR_DBR                   1029
#define CWG2DBR_DBR0                  1030
#define CWG2DBR                       1031
#define CWG2DBR0                      1032
#define CWG2DBR_DBR1                  1033
#define CWG2DBR1                      1034
#define CWG2DBR_DBR2                  1035
#define CWG2DBR2                      1036
#define CWG2DBR_DBR3                  1037
#define CWG2DBR3                      1038
#define CWG2DBR_DBR4                  1039
#define CWG2DBR4                      1040
#define CWG2DBR_DBR5                  1041
#define CWG2DBR5                      1042
#define CWG2DBF                       1043
#define CWG2DBF_DBF0                  1044
#define CWG2DBF_DBF                   1045
#define CWG2DBF0                      1046
#define CWG2DBF_DBF1                  1047
#define CWG2DBF1                      1048
#define CWG2DBF_DBF2                  1049
#define CWG2DBF2                      1050
#define CWG2DBF_DBF3                  1051
#define CWG2DBF3                      1052
#define CWG2DBF_DBF4                  1053
#define CWG2DBF4                      1054
#define CWG2DBF5                      1055
#define CWG2DBF_DBF5                  1056
#define CWG2CON0                      1057
#define CWG2MODE                      1058
#define CWG2MODE0                     1059
#define CWG2CON0_MODE                 1060
#define CWG2CON0_MODE0                1061
#define CWG2MODE1                     1062
#define CWG2CON0_MODE1                1063
#define CWG2MODE2                     1064
#define CWG2CON0_MODE2                1065
#define CWG2LD                        1066
#define CWG2CON0_LD                   1067
#define CWG2CON0_EN                   1068
#define CWG2EN                        1069
#define G2EN                          1070
#define CWG2CON1                      1071
#define CWG2POLA                      1072
#define CWG2CON1_POLA                 1073
#define CWG2POLB                      1074
#define CWG2CON1_POLB                 1075
#define CWG2POLC                      1076
#define CWG2CON1_POLC                 1077
#define CWG2CON1_POLD                 1078
#define CWG2POLD                      1079
#define CWG2IN                        1080
#define CWG2CON1_IN                   1081
#define CWG2AS0                       1082
#define CWG2LSAC                      1083
#define CWG2AS0_LSAC                  1084
#define CWG2LSAC0                     1085
#define CWG2AS0_LSAC0                 1086
#define CWG2LSAC1                     1087
#define CWG2AS0_LSAC1                 1088
#define CWG2AS0_LSBD0                 1089
#define CWG2LSBD                      1090
