tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18344_tdd.h
#define CWG2AS0_LSBD                  1091
#define CWG2LSBD0                     1092
#define CWG2AS0_LSBD1                 1093
#define CWG2LSBD1                     1094
#define CWG2AS0_REN                   1095
#define CWG2REN                       1096
#define CWG2AS0_SHUTDOWN              1097
#define CWG2SHUTDOWN                  1098
#define CWG2AS1                       1099
#define CWG2AS1_AS0E                  1100
#define CWG2AS1_AS1E                  1101
#define CWG2AS1_AS2E                  1102
#define CWG2AS1_AS3E                  1103
#define CWG2AS1_AS4E                  1104
#define CWG2STR                       1105
#define CWG2STR_STRA                  1106
#define CWG2STRA                      1107
#define CWG2STR_STRB                  1108
#define CWG2STRB                      1109
#define CWG2STR_STRC                  1110
#define CWG2STRC                      1111
#define CWG2STR_STRD                  1112
#define CWG2STRD                      1113
#define CWG2STR_OVRA                  1114
#define CWG2OVRA                      1115
#define CWG2OVRB                      1116
#define CWG2STR_OVRB                  1117
#define CWG2STR_OVRC                  1118
#define CWG2OVRC                      1119
#define CWG2OVRD                      1120
#define CWG2STR_OVRD                  1121
#define NVMADR0                       1122
#define NVMADRL                       1123
#define NVMADR1                       1124
#define NVMADR2                       1125
#define NVMADR3                       1126
#define NVMADR4                       1127
#define NVMADR5                       1128
#define NVMADR6                       1129
#define NVMADR7                       1130
#define NVMADR8                       1131
#define NVMADRH                       1132
#define NVMADR9                       1133
#define NVMADR10                      1134
#define NVMADR11                      1135
#define NVMADR12                      1136
#define NVMADR13                      1137
#define NVMADR14                      1138
#define NVMDAT0                       1139
#define NVMDATL                       1140
#define NVMDAT1                       1141
#define NVMDAT2                       1142
#define NVMDAT3                       1143
#define NVMDAT4                       1144
#define NVMDAT5                       1145
#define NVMDAT6                       1146
#define NVMDAT7                       1147
#define NVMDAT8                       1148
#define NVMDATH                       1149
#define NVMDAT9                       1150
#define NVMDAT10                      1151
#define NVMDAT11                      1152
#define NVMDAT12                      1153
#define NVMDAT13                      1154
#define NVMCON1                       1155
#define RD                            1156
#define WR                            1157
#define WREN                          1158
#define WRERR                         1159
#define FREE                          1160
#define LWLO                          1161
#define NVMREGS                       1162
#define NVMCON2                       1163
#define NMVCON2                       1164
#define PCON0                         1165
#define nBOR                          1166
#define nPOR                          1167
#define nRI                           1168
#define nRMCLR                        1169
#define nRWDT                         1170
#define STKUNF                        1171
#define STKOVF                        1172
#define PMD0                          1173
#define IOCMD                         1174
#define CLKRMD                        1175
#define NVMMD                         1176
#define FVRMD                         1177
#define SYSCMD                        1178
#define PMD1                          1179
#define TMR0MD                        1180
#define TMR1MD                        1181
#define TMR2MD                        1182
#define TMR3MD                        1183
#define TMR4MD                        1184
#define TMR5MD                        1185
#define TMR6MD                        1186
#define NCOMD                         1187
#define PMD2                          1188
#define CMP1MD                        1189
#define CMP2MD                        1190
#define ADCMD                         1191
#define DACMD                         1192
#define PMD3                          1193
#define CCP1MD                        1194
#define CCP2MD                        1195
#define CCP3MD                        1196
#define CCP4MD                        1197
#define PWM5MD                        1198
#define PWM6MD                        1199
#define CWG1MD                        1200
#define CWG2MD                        1201
#define PMD4                          1202
#define MSSP1MD                       1203
#define UART1MD                       1204
#define PMD5                          1205
#define DSMMD                         1206
#define CLC1MD                        1207
#define CLC2MD                        1208
#define CLC3MD                        1209
#define CLC4MD                        1210
#define CPUDOZE                       1211
#define DOZE0                         1212
#define DOZE                          1213
#define DOZE1                         1214
#define DOZE2                         1215
#define DOE                           1216
#define ROI                           1217
#define DOZEN                         1218
#define IDLEN                         1219
#define OSCCON1                       1220
#define NDIV0                         1221
#define NDIV                          1222
#define NDIV1                         1223
#define NDIV2                         1224
#define NDIV3                         1225
#define NOSC0                         1226
#define NOSC                          1227
#define NOSC1                         1228
#define NOSC2                         1229
#define OSCCON2                       1230
#define CDIV0                         1231
#define CDIV                          1232
#define CDIV1                         1233
#define CDIV2                         1234
#define CDIV3                         1235
#define COSC                          1236
#define COSC0                         1237
#define COSC1                         1238
#define COSC2                         1239
#define OSCCON3                       1240
#define NOSCR                         1241
#define ORDY                          1242
#define SOSCBE                        1243
#define SOSCPWR                       1244
#define CSWHOLD                       1245
#define OSCSTAT1                      1246
#define PLLR                          1247
#define ADOR                          1248
#define SOR                           1249
#define LFOR                          1250
#define HFOR                          1251
#define EXTOR                         1252
#define OSCEN                         1253
#define ADOEN                         1254
#define SOSCEN                        1255
#define LFOEN                         1256
#define HFOEN                         1257
#define EXTOEN                        1258
#define OSCTUNE                       1259
#define HFTUN0                        1260
#define HFTUN                         1261
#define HFTUN1                        1262
#define HFTUN2                        1263
#define HFTUN3                        1264
#define HFTUN4                        1265
#define HFTUN5                        1266
#define OSCFRQ                        1267
#define HFFRQ                         1268
#define HFFRQ0                        1269
#define HFFRQ1                        1270
#define HFFRQ2                        1271
#define HFFRQ3                        1272
#define PPSLOCK                       1273
#define PPSLOCKED                     1274
#define INTPPS0                       1275
#define INTPPS                        1276
#define INTPPS1                       1277
#define INTPPS2                       1278
#define INTPPS3                       1279
#define INTPPS4                       1280
#define T0CKIPPS0                     1281
#define T0CKIPPS                      1282
#define T0CKIPPS1                     1283
#define T0CKIPPS2                     1284
#define T0CKIPPS3                     1285
#define T0CKIPPS4                     1286
#define T1CKIPPS0                     1287
#define T1CKIPPS                      1288
#define T1CKIPPS1                     1289
#define T1CKIPPS2                     1290
#define T1CKIPPS3                     1291
#define T1CKIPPS4                     1292
#define T1GPPS0                       1293
#define T1GPPS                        1294
#define T1GPPS1                       1295
#define T1GPPS2                       1296
#define T1GPPS3                       1297
#define T1GPPS4                       1298
#define CCP1PPS0                      1299
#define CCP1PPS                       1300
#define CCP1PPS1                      1301
#define CCP1PPS2                      1302
#define CCP1PPS3                      1303
#define CCP1PPS4                      1304
#define CCP2PPS0                      1305
#define CCP2PPS                       1306
#define CCP2PPS1                      1307
#define CCP2PPS2                      1308
#define CCP2PPS3                      1309
#define CCP2PPS4                      1310
#define CCP3PPS0                      1311
#define CCP3PPS                       1312
#define CCP3PPS1                      1313
#define CCP3PPS2                      1314
#define CCP3PPS3                      1315
#define CCP3PPS4                      1316
#define CCP4PPS0                      1317
#define CCP4PPS                       1318
#define CCP4PPS1                      1319
#define CCP4PPS2                      1320
#define CCP4PPS3                      1321
#define CCP4PPS4                      1322
#define CWG1PPS0                      1323
#define CWG1PPS                       1324
#define CWG1PPS1                      1325
#define CWG1PPS2                      1326
#define CWG1PPS3                      1327
#define CWG1PPS4                      1328
#define CWG2PPS0                      1329
#define CWG2PPS                       1330
#define CWG2PPS1                      1331
#define CWG2PPS2                      1332
#define CWG2PPS3                      1333
#define CWG2PPS4                      1334
#define MDCIN1PPS                     1335
#define MDCIN1PPS0                    1336
#define MDCIN1PPS1                    1337
#define MDCIN1PPS2                    1338
#define MDCIN1PPS3                    1339
#define MDCIN1PPS4                    1340
#define MDCIN2PPS0                    1341
#define MDCIN2PPS                     1342
#define MDCIN2PPS1                    1343
#define MDCIN2PPS2                    1344
#define MDCIN2PPS3                    1345
#define MDCIN2PPS4                    1346
#define MDMINPPS                      1347
#define MDMINPPS0                     1348
#define MDMINPPS1                     1349
#define MDMINPPS2                     1350
#define MDMINPPS3                     1351
#define MDMINPPS4                     1352
#define SSP1CLKPPS0                   1353
#define SSP1CLKPPS                    1354
#define SSP1CLKPPS1                   1355
#define SSP1CLKPPS2                   1356
#define SSP1CLKPPS3                   1357
#define SSP1CLKPPS4                   1358
#define SSP1DATPPS0                   1359
#define SSP1DATPPS                    1360
#define SSP1DATPPS1                   1361
#define SSP1DATPPS2                   1362
#define SSP1DATPPS3                   1363
#define SSP1DATPPS4                   1364
#define SSP1SSPPS                     1365
#define SSP1SSPPS0                    1366
#define SSP1SSPPS1                    1367
#define SSP1SSPPS2                    1368
#define SSP1SSPPS3                    1369
#define SSP1SSPPS4                    1370
#define RXPPS                         1371
#define RXDTPPS0                      1372
#define RXDTPPS1                      1373
#define RXDTPPS2                      1374
#define RXDTPPS3                      1375
#define RXDTPPS4                      1376
#define TXCKPPS0                      1377
#define TXPPS                         1378
#define TXCKPPS1                      1379
#define TXCKPPS2                      1380
#define TXCKPPS3                      1381
#define TXCKPPS4                      1382
#define CLCIN0PPS                     1383
#define CLCIN0PPS0                    1384
#define CLCIN0PPS1                    1385
#define CLCIN0PPS2                    1386
#define CLCIN0PPS3                    1387
#define CLCIN0PPS4                    1388
#define CLCIN1PPS0                    1389
#define CLCIN1PPS                     1390
#define CLCIN1PPS1                    1391
#define CLCIN1PPS2                    1392
#define CLCIN1PPS3                    1393
#define CLCIN1PPS4                    1394
#define CLCIN2PPS                     1395
#define CLCIN2PPS0                    1396
#define CLCIN2PPS1                    1397
#define CLCIN2PPS2                    1398
#define CLCIN2PPS3                    1399
#define CLCIN2PPS4                    1400
#define CLCIN3PPS                     1401
#define CLCIN3PPS0                    1402
#define CLCIN3PPS1                    1403
#define CLCIN3PPS2                    1404
#define CLCIN3PPS3                    1405
#define CLCIN3PPS4                    1406
#define T3CKIPPS                      1407
#define T3GPPS                        1408
#define T5CKIPPS                      1409
#define T5GPPS                        1410
#define RA0PPS                        1411
#define RA0PPS0                       1412
#define RA0PPS1                       1413
#define RA0PPS2                       1414
#define RA0PPS3                       1415
#define RA0PPS4                       1416
#define RA1PPS                        1417
#define RA1PPS0                       1418
#define RA1PPS1                       1419
#define RA1PPS2                       1420
#define RA1PPS3                       1421
#define RA1PPS4                       1422
#define RA2PPS0                       1423
#define RA2PPS                        1424
#define RA2PPS1                       1425
#define RA2PPS2                       1426
#define RA2PPS3                       1427
#define RA2PPS4                       1428
#define RA4PPS                        1429
#define RA4PPS0                       1430
#define RA4PPS1                       1431
#define RA4PPS2                       1432
#define RA4PPS3                       1433
#define RA4PPS4                       1434
#define RA5PPS                        1435
#define RA5PPS0                       1436
#define RA5PPS1                       1437
#define RA5PPS2                       1438
#define RA5PPS3                       1439
#define RA5PPS4                       1440
#define RB4PPS                        1441
#define RB4PPS0                       1442
#define RB4PPS1                       1443
#define RB4PPS2                       1444
#define RB4PPS3                       1445
#define RB4PPS4                       1446
#define RB5PPS                        1447
#define RB5PPS0                       1448
#define RB5PPS1                       1449
#define RB5PPS2                       1450
#define RB5PPS3                       1451
#define RB5PPS4                       1452
#define RB6PPS0                       1453
#define RB6PPS                        1454
#define RB6PPS1                       1455
#define RB6PPS2                       1456
#define RB6PPS3                       1457
#define RB6PPS4                       1458
#define RB7PPS0                       1459
#define RB7PPS                        1460
#define RB7PPS1                       1461
#define RB7PPS2                       1462
#define RB7PPS3                       1463
#define RB7PPS4                       1464
#define RC0PPS                        1465
#define RC0PPS0                       1466
#define RC0PPS1                       1467
#define RC0PPS2                       1468
#define RC0PPS3                       1469
#define RC0PPS4                       1470
#define RC1PPS0                       1471
#define RC1PPS                        1472
#define RC1PPS1                       1473
#define RC1PPS2                       1474
#define RC1PPS3                       1475
#define RC1PPS4                       1476
#define RC2PPS                        1477
#define RC2PPS0                       1478
#define RC2PPS1                       1479
#define RC2PPS2                       1480
#define RC2PPS3                       1481
#define RC2PPS4                       1482
#define RC3PPS                        1483
#define RC3PPS0                       1484
#define RC3PPS1                       1485
#define RC3PPS2                       1486
#define RC3PPS3                       1487
#define RC3PPS4                       1488
#define RC4PPS0                       1489
#define RC4PPS                        1490
#define RC4PPS1                       1491
#define RC4PPS2                       1492
#define RC4PPS3                       1493
#define RC4PPS4                       1494
#define RC5PPS0                       1495
#define RC5PPS                        1496
#define RC5PPS1                       1497
#define RC5PPS2                       1498
#define RC5PPS3                       1499
#define RC5PPS4                       1500
#define RC6PPS                        1501
#define RC6PPS0                       1502
#define RC6PPS1                       1503
#define RC6PPS2                       1504
#define RC6PPS3                       1505
#define RC6PPS4                       1506
#define RC7PPS                        1507
#define RC7PPS0                       1508
#define RC7PPS1                       1509
#define RC7PPS2                       1510
#define RC7PPS3                       1511
#define RC7PPS4                       1512
#define CLCDATA                       1513
#define MLC1OUT                       1514
#define MLC2OUT                       1515
#define MLC3OUT                       1516
#define MLC4OUT                       1517
#define CLC1CON                       1518
#define CLC1CON_MODE0                 1519
#define LC1MODE                       1520
#define CLC1CON_MODE                  1521
#define LC1MODE0                      1522
#define CLC1CON_MODE1                 1523
#define LC1MODE1                      1524
#define LC1MODE2                      1525
#define CLC1CON_MODE2                 1526
#define LC1INTN                       1527
#define CLC1CON_INTN                  1528
#define CLC1CON_INTP                  1529
#define LC1INTP                       1530
#define LC1OUT                        1531
#define CLC1CON_OUT                   1532
#define CLC1CON_EN                    1533
#define LC1EN                         1534
#define CLC1POL                       1535
#define LC1G1POL                      1536
#define CLC1POL_G1POL                 1537
#define CLC1POL_G2POL                 1538
#define LC1G2POL                      1539
#define LC1G3POL                      1540
#define CLC1POL_G3POL                 1541
#define LC1G4POL                      1542
#define CLC1POL_G4POL                 1543
#define CLC1POL_POL                   1544
#define LC1POL                        1545
#define CLC1SEL0                      1546
#define CLC1SEL0_D1S0                 1547
#define LC1D1S0                       1548
#define CLC1SEL0_D1S                  1549
#define LC1D1S                        1550
#define CLC1SEL0_D1S1                 1551
#define LC1D1S1                       1552
#define CLC1SEL0_D1S2                 1553
#define LC1D1S2                       1554
#define LC1D1S3                       1555
#define CLC1SEL0_D1S3                 1556
#define CLC1SEL0_D1S4                 1557
#define LC1D1S4                       1558
#define CLC1SEL0_D1S5                 1559
#define LC1D1S5                       1560
#define CLC1SEL1                      1561
#define CLC1SEL1_D2S0                 1562
#define CLC1SEL1_D2S                  1563
#define LC1D2S                        1564
#define LC1D2S0                       1565
#define CLC1SEL1_D2S1                 1566
#define LC1D2S1                       1567
#define CLC1SEL1_D2S2                 1568
#define LC1D2S2                       1569
#define LC1D2S3                       1570
#define CLC1SEL1_D2S3                 1571
#define LC1D2S4                       1572
#define CLC1SEL1_D2S4                 1573
#define LC1D2S5                       1574
#define CLC1SEL1_D2S5                 1575
#define CLC1SEL2                      1576
#define LC1D3S0                       1577
#define CLC1SEL2_D3S                  1578
#define LC1D3S                        1579
#define CLC1SEL2_D3S0                 1580
#define LC1D3S1                       1581
#define CLC1SEL2_D3S1                 1582
#define LC1D3S2                       1583
#define CLC1SEL2_D3S2                 1584
#define LC1D3S3                       1585
#define CLC1SEL2_D3S3                 1586
#define LC1D3S4                       1587
#define CLC1SEL2_D3S4                 1588
#define LC1D3S5                       1589
#define CLC1SEL2_D3S5                 1590
#define CLC1SEL3                      1591
#define CLC1SEL3_D4S                  1592
#define LC1D4S                        1593
#define LC1D4S0                       1594
#define CLC1SEL3_D4S0                 1595
#define CLC1SEL3_D4S1                 1596
#define LC1D4S1                       1597
#define LC1D4S2                       1598
#define CLC1SEL3_D4S2                 1599
#define LC1D4S3                       1600
#define CLC1SEL3_D4S3                 1601
#define LC1D4S4                       1602
#define CLC1SEL3_D4S4                 1603
#define LC1D4S5                       1604
#define CLC1SEL3_D4S5                 1605
#define CLC1GLS0                      1606
#define CLC1GLS0_D1N                  1607
#define LC1G1D1N                      1608
#define CLC1GLS0_D1T                  1609
#define LC1G1D1T                      1610
#define LC1G1D2N                      1611
#define CLC1GLS0_D2N                  1612
#define LC1G1D2T                      1613
#define CLC1GLS0_D2T                  1614
#define CLC1GLS0_D3N                  1615
#define LC1G1D3N                      1616
#define CLC1GLS0_D3T                  1617
#define LC1G1D3T                      1618
#define CLC1GLS0_D4N                  1619
#define LC1G1D4N                      1620
#define CLC1GLS0_D4T                  1621
#define LC1G1D4T                      1622
#define CLC1GLS1                      1623
#define CLC1GLS1_D1N                  1624
#define LC1G2D1N                      1625
#define LC1G2D1T                      1626
#define CLC1GLS1_D1T                  1627
#define CLC1GLS1_D2N                  1628
#define LC1G2D2N                      1629
#define LC1G2D2T                      1630
#define CLC1GLS1_D2T                  1631
#define CLC1GLS1_D3N                  1632
#define LC1G2D3N                      1633
#define LC1G2D3T                      1634
#define CLC1GLS1_D3T                  1635
#define CLC1GLS1_D4N                  1636
#define LC1G2D4N                      1637
#define LC1G2D4T                      1638
#define CLC1GLS1_D4T                  1639
#define CLC1GLS2                      1640
#define CLC1GLS2_D1N                  1641
#define LC1G3D1N                      1642
#define LC1G3D1T                      1643
#define CLC1GLS2_D1T                  1644
#define LC1G3D2N                      1645
#define CLC1GLS2_D2N                  1646
#define LC1G3D2T                      1647
#define CLC1GLS2_D2T                  1648
