tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18344_tdd.h
#define CLC1GLS2_D3N                  1649
#define LC1G3D3N                      1650
#define LC1G3D3T                      1651
#define CLC1GLS2_D3T                  1652
#define LC1G3D4N                      1653
#define CLC1GLS2_D4N                  1654
#define LC1G3D4T                      1655
#define CLC1GLS2_D4T                  1656
#define CLC1GLS3                      1657
#define LC1G4D1N                      1658
#define CLC1GLS3_G4D1N                1659
#define LC1G4D1T                      1660
#define CLC1GLS3_G4D1T                1661
#define CLC1GLS3_G4D2N                1662
#define LC1G4D2N                      1663
#define CLC1GLS3_G4D2T                1664
#define LC1G4D2T                      1665
#define LC1G4D3N                      1666
#define CLC1GLS3_G4D3N                1667
#define LC1G4D3T                      1668
#define CLC1GLS3_G4D3T                1669
#define CLC1GLS3_G4D4N                1670
#define LC1G4D4N                      1671
#define CLC1GLS3_G4D4T                1672
#define LC1G4D4T                      1673
#define CLC2CON                       1674
#define LC2MODE0                      1675
#define CLC2CON_MODE                  1676
#define LC2MODE                       1677
#define CLC2CON_MODE0                 1678
#define LC2MODE1                      1679
#define CLC2CON_MODE1                 1680
#define LC2MODE2                      1681
#define CLC2CON_MODE2                 1682
#define LC2INTN                       1683
#define CLC2CON_INTN                  1684
#define LC2INTP                       1685
#define CLC2CON_INTP                  1686
#define CLC2CON_OUT                   1687
#define LC2OUT                        1688
#define CLC2CON_EN                    1689
#define LC2EN                         1690
#define CLC2POL                       1691
#define LC2G1POL                      1692
#define CLC2POL_G1POL                 1693
#define LC2G2POL                      1694
#define CLC2POL_G2POL                 1695
#define LC2G3POL                      1696
#define CLC2POL_G3POL                 1697
#define LC2G4POL                      1698
#define CLC2POL_G4POL                 1699
#define CLC2POL_POL                   1700
#define LC2POL                        1701
#define CLC2SEL0                      1702
#define CLC2SEL0_D1S                  1703
#define LC2D1S0                       1704
#define CLC2SEL0_D1S0                 1705
#define LC2D1S                        1706
#define LC2D1S1                       1707
#define CLC2SEL0_D1S1                 1708
#define LC2D1S2                       1709
#define CLC2SEL0_D1S2                 1710
#define CLC2SEL0_D1S3                 1711
#define LC2D1S3                       1712
#define LC2D1S4                       1713
#define CLC2SEL0_D1S4                 1714
#define LC2D1S5                       1715
#define CLC2SEL0_D1S5                 1716
#define CLC2SEL1                      1717
#define LC2D2S0                       1718
#define CLC2SEL1_D2S0                 1719
#define LC2D2S                        1720
#define CLC2SEL1_D2S                  1721
#define LC2D2S1                       1722
#define CLC2SEL1_D2S1                 1723
#define LC2D2S2                       1724
#define CLC2SEL1_D2S2                 1725
#define LC2D2S3                       1726
#define CLC2SEL1_D2S3                 1727
#define LC2D2S4                       1728
#define CLC2SEL1_D2S4                 1729
#define LC2D2S5                       1730
#define CLC2SEL1_D2S5                 1731
#define CLC2SEL2                      1732
#define CLC2SEL2_D3S                  1733
#define LC2D3S0                       1734
#define CLC2SEL2_D3S0                 1735
#define LC2D3S                        1736
#define CLC2SEL2_D3S1                 1737
#define LC2D3S1                       1738
#define LC2D3S2                       1739
#define CLC2SEL2_D3S2                 1740
#define LC2D3S3                       1741
#define CLC2SEL2_D3S3                 1742
#define LC2D3S4                       1743
#define CLC2SEL2_D3S4                 1744
#define LC2D3S5                       1745
#define CLC2SEL2_D3S5                 1746
#define CLC2SEL3                      1747
#define LC2D4S0                       1748
#define CLC2SEL3_D4S                  1749
#define CLC2SEL3_D4S0                 1750
#define LC2D4S                        1751
#define LC2D4S1                       1752
#define CLC2SEL3_D4S1                 1753
#define LC2D4S2                       1754
#define CLC2SEL3_D4S2                 1755
#define CLC2SEL3_D4S3                 1756
#define LC2D4S3                       1757
#define LC2D4S4                       1758
#define CLC2SEL3_D4S4                 1759
#define LC2D4S5                       1760
#define CLC2SEL3_D4S5                 1761
#define CLC2GLS0                      1762
#define LC2G1D1N                      1763
#define CLC2GLS0_D1N                  1764
#define CLC2GLS0_D1T                  1765
#define LC2G1D1T                      1766
#define LC2G1D2N                      1767
#define CLC2GLS0_D2N                  1768
#define CLC2GLS0_D2T                  1769
#define LC2G1D2T                      1770
#define LC2G1D3N                      1771
#define CLC2GLS0_D3N                  1772
#define CLC2GLS0_D3T                  1773
#define LC2G1D3T                      1774
#define LC2G1D4N                      1775
#define CLC2GLS0_D4N                  1776
#define CLC2GLS0_D4T                  1777
#define LC2G1D4T                      1778
#define CLC2GLS1                      1779
#define CLC2GLS1_D1N                  1780
#define LC2G2D1N                      1781
#define CLC2GLS1_D1T                  1782
#define LC2G2D1T                      1783
#define CLC2GLS1_D2N                  1784
#define LC2G2D2N                      1785
#define CLC2GLS1_D2T                  1786
#define LC2G2D2T                      1787
#define LC2G2D3N                      1788
#define CLC2GLS1_D3N                  1789
#define LC2G2D3T                      1790
#define CLC2GLS1_D3T                  1791
#define LC2G2D4N                      1792
#define CLC2GLS1_D4N                  1793
#define LC2G2D4T                      1794
#define CLC2GLS1_D4T                  1795
#define CLC2GLS2                      1796
#define LC2G3D1N                      1797
#define CLC2GLS2_D1N                  1798
#define CLC2GLS2_D1T                  1799
#define LC2G3D1T                      1800
#define CLC2GLS2_D2N                  1801
#define LC2G3D2N                      1802
#define LC2G3D2T                      1803
#define CLC2GLS2_D2T                  1804
#define CLC2GLS2_D3N                  1805
#define LC2G3D3N                      1806
#define CLC2GLS2_D3T                  1807
#define LC2G3D3T                      1808
#define CLC2GLS2_D4N                  1809
#define LC2G3D4N                      1810
#define LC2G3D4T                      1811
#define CLC2GLS2_D4T                  1812
#define CLC2GLS3                      1813
#define LC2G4D1N                      1814
#define CLC2GLS3_G4D1N                1815
#define CLC2GLS3_G4D1T                1816
#define LC2G4D1T                      1817
#define CLC2GLS3_G4D2N                1818
#define LC2G4D2N                      1819
#define LC2G4D2T                      1820
#define CLC2GLS3_G4D2T                1821
#define CLC2GLS3_G4D3N                1822
#define LC2G4D3N                      1823
#define CLC2GLS3_G4D3T                1824
#define LC2G4D3T                      1825
#define LC2G4D4N                      1826
#define CLC2GLS3_G4D4N                1827
#define CLC2GLS3_G4D4T                1828
#define LC2G4D4T                      1829
#define CLC3CON                       1830
#define LC3MODE                       1831
#define CLC3CON_MODE0                 1832
#define LC3MODE0                      1833
#define CLC3CON_MODE                  1834
#define CLC3CON_MODE1                 1835
#define LC3MODE1                      1836
#define CLC3CON_MODE2                 1837
#define LC3MODE2                      1838
#define LC3INTN                       1839
#define CLC3CON_INTN                  1840
#define LC3INTP                       1841
#define CLC3CON_INTP                  1842
#define LC3OUT                        1843
#define CLC3CON_OUT                   1844
#define LC3EN                         1845
#define CLC3CON_EN                    1846
#define CLC3POL                       1847
#define LC3G1POL                      1848
#define CLC3POL_G1POL                 1849
#define LC3G2POL                      1850
#define CLC3POL_G2POL                 1851
#define CLC3POL_G3POL                 1852
#define LC3G3POL                      1853
#define LC3G4POL                      1854
#define CLC3POL_G4POL                 1855
#define LC3POL                        1856
#define CLC3POL_POL                   1857
#define CLC3SEL0                      1858
#define CLC3SEL0_D1S0                 1859
#define LC3D1S0                       1860
#define CLC3SEL0_D1S                  1861
#define LC3D1S                        1862
#define LC3D1S1                       1863
#define CLC3SEL0_D1S1                 1864
#define LC3D1S2                       1865
#define CLC3SEL0_D1S2                 1866
#define LC3D1S3                       1867
#define CLC3SEL0_D1S3                 1868
#define LC3D1S4                       1869
#define CLC3SEL0_D1S4                 1870
#define LC3D1S5                       1871
#define CLC3SEL0_D1S5                 1872
#define CLC3SEL1                      1873
#define CLC3SEL1_D2S                  1874
#define CLC3SEL1_D2S0                 1875
#define LC3D2S                        1876
#define LC3D2S0                       1877
#define CLC3SEL1_D2S1                 1878
#define LC3D2S1                       1879
#define CLC3SEL1_D2S2                 1880
#define LC3D2S2                       1881
#define CLC3SEL1_D2S3                 1882
#define LC3D2S3                       1883
#define CLC3SEL1_D2S4                 1884
#define LC3D2S4                       1885
#define CLC3SEL1_D2S5                 1886
#define LC3D2S5                       1887
#define CLC3SEL2                      1888
#define LC3D3S                        1889
#define CLC3SEL2_D3S                  1890
#define LC3D3S0                       1891
#define CLC3SEL2_D3S0                 1892
#define LC3D3S1                       1893
#define CLC3SEL2_D3S1                 1894
#define LC3D3S2                       1895
#define CLC3SEL2_D3S2                 1896
#define LC3D3S3                       1897
#define CLC3SEL2_D3S3                 1898
#define CLC3SEL2_D3S4                 1899
#define LC3D3S4                       1900
#define CLC3SEL2_D3S5                 1901
#define LC3D3S5                       1902
#define CLC3SEL3                      1903
#define CLC3SEL3_D4S0                 1904
#define LC3D4S0                       1905
#define CLC3SEL3_D4S                  1906
#define LC3D4S                        1907
#define LC3D4S1                       1908
#define CLC3SEL3_D4S1                 1909
#define LC3D4S2                       1910
#define CLC3SEL3_D4S2                 1911
#define LC3D4S3                       1912
#define CLC3SEL3_D4S3                 1913
#define LC3D4S4                       1914
#define CLC3SEL3_D4S4                 1915
#define LC3D4S5                       1916
#define CLC3SEL3_D4S5                 1917
#define CLC3GLS0                      1918
#define CLC3GLS0_D1N                  1919
#define LC3G1D1N                      1920
#define LC3G1D1T                      1921
#define CLC3GLS0_D1T                  1922
#define LC3G1D2N                      1923
#define CLC3GLS0_D2N                  1924
#define CLC3GLS0_D2T                  1925
#define LC3G1D2T                      1926
#define CLC3GLS0_D3N                  1927
#define LC3G1D3N                      1928
#define LC3G1D3T                      1929
#define CLC3GLS0_D3T                  1930
#define CLC3GLS0_D4N                  1931
#define LC3G1D4N                      1932
#define CLC3GLS0_D4T                  1933
#define LC3G1D4T                      1934
#define CLC3GLS1                      1935
#define LC3G2D1N                      1936
#define CLC3GLS1_D1N                  1937
#define CLC3GLS1_D1T                  1938
#define LC3G2D1T                      1939
#define LC3G2D2N                      1940
#define CLC3GLS1_D2N                  1941
#define LC3G2D2T                      1942
#define CLC3GLS1_D2T                  1943
#define LC3G2D3N                      1944
#define CLC3GLS1_D3N                  1945
#define CLC3GLS1_D3T                  1946
#define LC3G2D3T                      1947
#define LC3G2D4N                      1948
#define CLC3GLS1_D4N                  1949
#define LC3G2D4T                      1950
#define CLC3GLS1_D4T                  1951
#define CLC3GLS2                      1952
#define LC3G3D1N                      1953
#define CLC3GLS2_D1N                  1954
#define LC3G3D1T                      1955
#define CLC3GLS2_D1T                  1956
#define CLC3GLS2_D2N                  1957
#define LC3G3D2N                      1958
#define CLC3GLS2_D2T                  1959
#define LC3G3D2T                      1960
#define CLC3GLS2_D3N                  1961
#define LC3G3D3N                      1962
#define LC3G3D3T                      1963
#define CLC3GLS2_D3T                  1964
#define CLC3GLS2_D4N                  1965
#define LC3G3D4N                      1966
#define CLC3GLS2_D4T                  1967
#define LC3G3D4T                      1968
#define CLC3GLS3                      1969
#define LC3G4D1N                      1970
#define CLC3GLS3_G4D1N                1971
#define LC3G4D1T                      1972
#define CLC3GLS3_G4D1T                1973
#define LC3G4D2N                      1974
#define CLC3GLS3_G4D2N                1975
#define CLC3GLS3_G4D2T                1976
#define LC3G4D2T                      1977
#define LC3G4D3N                      1978
#define CLC3GLS3_G4D3N                1979
#define CLC3GLS3_G4D3T                1980
#define LC3G4D3T                      1981
#define LC3G4D4N                      1982
#define CLC3GLS3_G4D4N                1983
#define LC3G4D4T                      1984
#define CLC3GLS3_G4D4T                1985
#define CLC4CON                       1986
#define LC4MODE                       1987
#define CLC4CON_MODE                  1988
#define LC4MODE0                      1989
#define CLC4CON_MODE0                 1990
#define LC4MODE1                      1991
#define CLC4CON_MODE1                 1992
#define LC4MODE2                      1993
#define CLC4CON_MODE2                 1994
#define LC4INTN                       1995
#define CLC4CON_INTN                  1996
#define CLC4CON_INTP                  1997
#define LC4INTP                       1998
#define CLC4CON_OUT                   1999
#define LC4OUT                        2000
#define CLC4CON_EN                    2001
#define LC4EN                         2002
#define CLC4POL                       2003
#define CLC4POL_G1POL                 2004
#define LC4G1POL                      2005
#define CLC4POL_G2POL                 2006
#define LC4G2POL                      2007
#define CLC4POL_G3POL                 2008
#define LC4G3POL                      2009
#define LC4G4POL                      2010
#define CLC4POL_G4POL                 2011
#define LC4POL                        2012
#define CLC4POL_POL                   2013
#define CLC4SEL0                      2014
#define CLC4SEL0_D1S0                 2015
#define LC4D1S0                       2016
#define CLC4SEL0_D1S                  2017
#define LC4D1S                        2018
#define CLC4SEL0_D1S1                 2019
#define LC4D1S1                       2020
#define CLC4SEL0_D1S2                 2021
#define LC4D1S2                       2022
#define CLC4SEL0_D1S3                 2023
#define LC4D1S3                       2024
#define CLC4SEL0_D1S4                 2025
#define LC4D1S4                       2026
#define CLC4SEL0_D1S5                 2027
#define LC4D1S5                       2028
#define CLC4SEL1                      2029
#define LC4D2S0                       2030
#define CLC4SEL1_D2S                  2031
#define CLC4SEL1_D2S0                 2032
#define LC4D2S                        2033
#define CLC4SEL1_D2S1                 2034
#define LC4D2S1                       2035
#define LC4D2S2                       2036
#define CLC4SEL1_D2S2                 2037
#define LC4D2S3                       2038
#define CLC4SEL1_D2S3                 2039
#define LC4D2S4                       2040
#define CLC4SEL1_D2S4                 2041
#define LC4D2S5                       2042
#define CLC4SEL1_D2S5                 2043
#define CLC4SEL2                      2044
#define LC4D3S                        2045
#define CLC4SEL2_D3S                  2046
#define CLC4SEL2_D3S0                 2047
#define LC4D3S0                       2048
#define LC4D3S1                       2049
#define CLC4SEL2_D3S1                 2050
#define CLC4SEL2_D3S2                 2051
#define LC4D3S2                       2052
#define CLC4SEL2_D3S3                 2053
#define LC4D3S3                       2054
#define CLC4SEL2_D3S4                 2055
#define LC4D3S4                       2056
#define CLC4SEL2_D3S5                 2057
#define LC4D3S5                       2058
#define CLC4SEL3                      2059
#define LC4D4S0                       2060
#define LC4D4S                        2061
#define CLC4SEL3_D4S0                 2062
#define CLC4SEL3_D4S                  2063
#define LC4D4S1                       2064
#define CLC4SEL3_D4S1                 2065
#define LC4D4S2                       2066
#define CLC4SEL3_D4S2                 2067
#define LC4D4S3                       2068
#define CLC4SEL3_D4S3                 2069
#define LC4D4S4                       2070
#define CLC4SEL3_D4S4                 2071
#define LC4D4S5                       2072
#define CLC4SEL3_D4S5                 2073
#define CLC4GLS0                      2074
#define CLC4GLS0_D1N                  2075
#define LC4G1D1N                      2076
#define CLC4GLS0_D1T                  2077
#define LC4G1D1T                      2078
#define CLC4GLS0_D2N                  2079
#define LC4G1D2N                      2080
#define CLC4GLS0_D2T                  2081
#define LC4G1D2T                      2082
#define CLC4GLS0_D3N                  2083
#define LC4G1D3N                      2084
#define CLC4GLS0_D3T                  2085
#define LC4G1D3T                      2086
#define CLC4GLS0_D4N                  2087
#define LC4G1D4N                      2088
#define CLC4GLS0_D4T                  2089
#define LC4G1D4T                      2090
#define CLC4GLS1                      2091
#define CLC4GLS1_D1N                  2092
#define LC4G2D1N                      2093
#define CLC4GLS1_D1T                  2094
#define LC4G2D1T                      2095
#define LC4G2D2N                      2096
#define CLC4GLS1_D2N                  2097
#define LC4G2D2T                      2098
#define CLC4GLS1_D2T                  2099
#define CLC4GLS1_D3N                  2100
#define LC4G2D3N                      2101
#define LC4G2D3T                      2102
#define CLC4GLS1_D3T                  2103
#define CLC4GLS1_D4N                  2104
#define LC4G2D4N                      2105
#define CLC4GLS1_D4T                  2106
#define LC4G2D4T                      2107
#define CLC4GLS2                      2108
#define CLC4GLS2_D1N                  2109
#define LC4G3D1N                      2110
#define CLC4GLS2_D1T                  2111
#define LC4G3D1T                      2112
#define LC4G3D2N                      2113
#define CLC4GLS2_D2N                  2114
#define LC4G3D2T                      2115
#define CLC4GLS2_D2T                  2116
#define CLC4GLS2_D3N                  2117
#define LC4G3D3N                      2118
#define CLC4GLS2_D3T                  2119
#define LC4G3D3T                      2120
#define LC4G3D4N                      2121
#define CLC4GLS2_D4N                  2122
#define LC4G3D4T                      2123
#define CLC4GLS2_D4T                  2124
#define CLC4GLS3                      2125
#define CLC4GLS3_G4D1N                2126
#define LC4G4D1N                      2127
#define LC4G4D1T                      2128
#define CLC4GLS3_G4D1T                2129
#define LC4G4D2N                      2130
#define CLC4GLS3_G4D2N                2131
#define LC4G4D2T                      2132
#define CLC4GLS3_G4D2T                2133
#define CLC4GLS3_G4D3N                2134
#define LC4G4D3N                      2135
#define CLC4GLS3_G4D3T                2136
#define LC4G4D3T                      2137
#define LC4G4D4N                      2138
#define CLC4GLS3_G4D4N                2139
#define LC4G4D4T                      2140
#define CLC4GLS3_G4D4T                2141
#define STATUS_SHAD                   2142
#define C_SHAD                        2143
#define DC_SHAD                       2144
#define Z_SHAD                        2145
#define WREG_SHAD                     2146
#define BSR_SHAD                      2147
#define PCLATH_SHAD                   2148
#define FSR0L_SHAD                    2149
#define FSR0H_SHAD                    2150
#define FSR1L_SHAD                    2151
#define FSR1H_SHAD                    2152
#define STKPTR                        2153
#define TOSL                          2154
#define TOSH                          2155

#endif // _PIC16F18344_H_
